export default {
	langs: {
		en: 'Eng',
		kk: 'Қаз',
		ru: 'Рус',
	},
	pages: {
		home: {
			title: 'Басты бет',
			subtitle: 'Мен <span>фронтенд-әзірлеушімін</span> Қазақстаннан, Астана.',
		},
		about: {
			title: 'Мен туралы',
			subtitle: 'Мен туралы көбірек біліңіз',
			role: 'Фронтенд-әзірлеуші',
			text1:
				'Сәлеметсіз бе, мен Нұргелдімін. Төменде мен туралы біраз ақпарат бар',
			birthday: '6 желтоқсан 1995 ж',
			city: 'Астана',
			degree: 'Жоғары',
			freelance: 'Мүмкін',
			text2:
				'Мен веб-қосымшаларды әзірлеуде үлкен тәжірибесі бар веб-әзірлеушімін. Менің бағдарламалау әлеміне саяхатым 2015 жылы басталды, содан бері мен үнемі дамып, дағдыларымды шыңдадым. 2019 жылдан бастап сапалы және функционалды сайттар мен қосымшалар құра отырып, веб-әзірлеу саласында кәсіби жұмыс істеймін. Мен әрқашан жаңа қиындықтар мен мүмкіндіктерге ашықпын. Менің мақсатым-пайдаланушылар мен бизнеске пайда әкелетін инновациялық шешімдерді жасау. Мен ынтымақтастыққа сенемін және кез-келген ұсыныстарды талқылауға дайынмын.',
			subtitle1: 'Дағдылар',
			subtitle2: 'Қызығушылықтары',
			subtitle3: 'Пікірлер',
			interests: {
				1: 'HTML5 ойындары',
				2: 'Машиналық оқыту',
				3: 'Веб 3D',
			},
			otherSkills: 'Сонымен қатар келесі технологиялармен жұмыс істеді',
		},
		resume: {
			title: 'Түйіндеме',
			subtitle: 'Менің түйіндемемді тексеріңіз',
			subtitle1: 'Қысқаша',
			subtitle2: 'Білім',
			subtitle3: 'Кәсіби тәжірибе',
		},
		services: {
			title: 'Қызметтер',
			subtitle: 'Менің қызметтерім',
		},
		portfolio: {
			title: 'Портфолио',
			subtitle: 'Менің жұмысым',
		},
		contact: {
			title: 'Байланыс',
			subtitle: 'Маған хабарласыңыз',
			myaddress: 'Астана, Қазақстан',
			subtitle1: 'Әлеуметтік профильдер',
			emailme: 'Маған жазыңыз',
			callme: 'Маған қоңырау шалыңыз',
		},
	},
	labels: {
		birthday: 'Туған күн',
		website: 'Веб-сайт',
		phone: 'Телефон',
		city: 'Қала',
		age: 'Жасы',
		degree: 'Дәрежесі',
		email: 'Email',
		freelance: 'Фриланс',
		clients: 'Бақытты клиенттер',
		projects: 'Жобалар',
		supportTime: 'Қолдау сағаттары',
		awards: 'Марапаттар',
		myaddress: 'Менің мекен-жайым',
		loading: 'Жүктеу',
	},
	reviews: {
		0: {
			author: 'Сіз',
			text: 'Сіздің пікіріңіз осында болуы мүмкін',
			role: 'Керемет клиент',
		},
		1: {
			author: 'Сіз',
			text: 'Сіздің пікіріңіз осында болуы мүмкін',
			role: 'Керемет клиент',
		},
		2: {
			author: 'Сіз',
			text: 'Сіздің пікіріңіз осында болуы мүмкін',
			role: 'Керемет клиент',
		},
		3: {
			author: 'Сіз',
			text: 'Сіздің пікіріңіз осында болуы мүмкін',
			role: 'Керемет клиент',
		},
		4: {
			author: 'Сіз',
			text: 'Сіздің пікіріңіз осында болуы мүмкін',
			role: 'Керемет клиент',
		},
	},
	placeholder: {
		name: 'Сіздің атыңыз',
		email: 'Сіздің электрондық пошта мекенжайыңыз',
		subject: 'Тақырып',
		message: 'Хабарлама',
	},
	commands: {
		send: 'Хабарлама жіберу',
	},
	messeges: {
		sendedMessage: 'Сіздің хабарламаңыз жіберілді. Рахмет!',
	},
	filters: {
		all: 'Барлығы',
		app: 'Қосымша',
		web: 'Веб',
		card: 'Карта',
		apk: 'APK',
		pwa: 'PWA',
	},
	services: {
		0: {
			title: 'Фронтенд-әзірлеу',
			text: 'HTML5, CSS3 және заманауи CSS шеңберлерін (Bootstrap, Tailwind CSS) қолдана отырып, кросс-шолғыш және жауап беретін веб-әзірлеу. Бетті жүктеу мен өнімділікті оңтайландыру. Дамуды жеңілдету және жеделдету үшін препроцессорларды (Sass, LESS) пайдалану.',
		},
		1: {
			title: 'Сайт құру',
			text: 'Заманауи платформалар мен CMS (WordPress, Joomla, Drupal) сайттарын әзірлеу мен іске қосудың толық циклі. Әр түрлі API және сыртқы қызметтермен Интеграция (төлем жүйелері, әлеуметтік желілер, CRM). JavaScript және танымал Жақтауларды (React, Angular, Vue) пайдаланып динамикалық және интерактивті элементтерді құру.js).',
		},
		2: {
			title: 'PWA (прогрессивті веб-қосымша)',
			text: 'Мобильді құрылғыларда жұмыс істеудің ыңғайлылығын қамтамасыз ететін прогрессивті веб-қосымшаларды әзірлеу. Мазмұнды жылдам жүктеу үшін офлайн қол жетімділікті, push хабарландыруларын және кэштеуді енгізу. Максималды өнімділік пен пайдаланушыға ыңғайлы болу үшін қолданбаларды оңтайландыру.',
		},
		3: {
			title: 'Веб-сайтты қолдау',
			text: 'Мазмұнды үнемі жаңартып отыру және техникалық қолдау. Қателерді бақылау және түзету, қауіпсіздікті қамтамасыз ету. Іздеу жүйелеріндегі көрінуді жақсарту үшін SEO оңтайландыру. Пайдаланушы тәжірибесін талдау және жақсарту (UX/UI).',
		},
	},
	resume: `{'${JSON.stringify([
		{
			class: 'col-lg-6',
			blocks: [
				{
					title: 'Қысқаша мазмұны',
					subblocks: [
						{
							class: 'pb-0',
							title: 'Нұргелді Серікбай',
							year: '',
							italtext:
								'Бастапқы тұжырымдамадан түпкілікті, жылтыратылған нәтижеге дейін пайдаланушыға бағытталған цифрлық/баспа маркетингтік материалдарды жобалау және әзірлеу бойынша 3 жылдан астам тәжірибесі бар инновациялық және жолға бағытталған графикалық дизайнер.',
							text: '',
							list: [
								'Астана, Қазақстан',
								'+7 708 341 60 54',
								'nurikserikbay1995@gmail.com',
							],
						},
					],
				},
				{
					title: 'Білім',
					subblocks: [
						{
							class: '',
							title: 'Химия бакалавры',
							year: '2013 - 2017',
							italtext:
								'Л. Н. Гумилев атындағы Еуразия Ұлттық Университеті, Астана, Қазақстан',
							text: '',
							list: [],
						},
					],
				},
				{
					title: 'Кәсіби тәжірибе',
					subblocks: [
						{
							class: '',
							title: 'Веб-әзірлеуші',
							year: '2023 - Осы уақытқа дейін',
							italtext: '«Крокос» ЖШС, Астана, Қазақстан',
							text: '',
							list: [
								'Quasar және Vuetify сияқты интерфейс шеңберлерімен жұмыс.',
								'Tailwind CSS көмегімен сәндеу.',
								'PHP және Vue көмегімен монолитті жүйелерді жобалау және қолдау.js.',
								'Vue көмегімен пайдаланушы интерфейстерін әзірлеу.js',
								'Vue компоненттерімен тәжірибе, оның ішінде компоненттерді құру және қайта пайдалану',
								'Vuex, Pinia көмегімен мемлекеттік басқару',
								'Vue Router көмегімен маршруттауды орнату',
								'HTTP сұраулары үшін vgui Resource немесе Axios арқылы сервермен және клиентпен жұмыс істеу',
								'React және Next жобаларындағы қателерді түзету және қызмет көрсету.js.',
								'Қателерді түзету және ескірген жобаларды қайта өңдеу.',
								'Vue формасын тексеру және оқиғаларды өңдеу.js',
								'Vue қолданбасының өнімділігін оңтайландыру',
								'RESTful API құру және серверлік интеграция',
							],
						},
					],
				},
			],
		},
		{
			class: 'col-lg-6',
			blocks: [
				{
					title: '',
					subblocks: [
						{
							class: '',
							title: 'Vue, Nuxt әзірлеуші',
							year: '2022 - 2023',
							italtext: '«Ракетная фирма» ЖШС, Астана, Қазақстан',
							text: '',
							list: [
								'Компоненттерді орналастыру және әзірлеу, қателерді түзету',
								'Кодты тексеру',
								'Рефакторинг',
								'Vue көмегімен пайдаланушы интерфейстерін әзірлеу.js',
								'Vue компоненттерімен тәжірибе, оның ішінде компоненттерді құру және қайта пайдалану',
								'Veux көмегімен күйді басқару',
								'Vue Router көмегімен маршруттауды орнату',
								'HTTP сұраулары үшін vgui Resource немесе Axios арқылы сервермен және клиентпен жұмыс істеу',
								'Нақты уақыттағы деректерді өңдеу және WebSocket интеграциясы',
								'Vue Transitions көмегімен анимациялар мен ауысулар',
								'Vue формасын тексеру және оқиғаларды өңдеу.js',
								'Құрастыру құралдарын орнату және пайдалану (Webpack, vue CLI)',
								'CSS препроцессорларымен жұмыс (Sass, Less)',
								'Vue қолданбасының өнімділігін оңтайландыру',
								'Git көмегімен нұсқаларды басқару',
								'RESTful API құру және серверлік интеграция',
								'Пайдаланушы интерфейсінің компоненттері үшін атомдық дизайн принциптерін енгізу',
								'Масштабталатын және қолдау көрсетілетін кодтық базалар үшін модульдік архитектураны әзірлеу',
							],
						},
						{
							class: '',
							title: 'Vue әзірлеуші',
							year: '2020 - 2022',
							italtext: '«C&A Consulting Group» ЖШС, Астана, Қазақстан',
							text: 'SPA қосымшаларын, модельдеулерді, цифрлық білім беру ресурстарын әзірлеу',
							list: [
								'Жобаға жаңа кітапханаларды енгізу',
								'Дизайн жүйесін дамыту',
								'Жаңа пайдаланушы интерфейсін әзірлеуге қатысу',
								'Жаңа функцияларды әзірлеуге қатысу',
								'Орналасу',
								'Анимация',
								'Қателерді түзету',
								'Клиенттер мен клиенттердің менеджерлері үшін айына 4+ дизайн презентациялары мен ұсыныстарын жасады',
							],
						},
					],
				},
			],
		},
	])}'}`,
}
