export default {
	langs: {
		en: 'Eng',
		kk: 'Қаз',
		ru: 'Рус',
	},
	pages: {
		home: {
			title: 'Главная',
			subtitle:
				'Я <span>фронтенд-разработчик</span> из Казахстана, Астана.',
		},
		about: {
			title: 'Обо мне',
			subtitle: 'Узнайте больше обо мне',
			role: 'Фронтенд-разработчик',
			text1: 'Здравствуйте, я Нургельди. Ниже немного информации обо мне',
			birthday: '6 декабря 1995 г',
			city: 'Астана',
			degree: 'Высшее',
			freelance: 'Доступный',
			text2:
				'Я веб-разработчик с большим опытом разработки веб-приложений. Мой путь в мир программирования начался в 2015 году, и с тех пор я постоянно развиваюсь и оттачиваю свои навыки. С 2019 года профессионально работаю в сфере веб-разработки, создавая качественные и функциональные сайты и приложения. Я всегда открыт к новым вызовам и возможностям. Моя цель — создавать инновационные решения, которые принесут пользу пользователям и бизнесу. Рассчитываю на сотрудничество и готов обсудить любые предложения.',
			subtitle1: 'Навыки',
			subtitle2: 'Интересы',
			subtitle3: 'Отзывы',
			interests: {
				1: 'HTML5-игры',
				2: 'Машинное обучение',
				3: 'Веб 3D',
			},
			otherSkills: 'Также работал со следующими технологиями',
		},
		resume: {
			title: 'Резюме',
			subtitle: 'Проверьте мое резюме',
			subtitle1: 'Краткое',
			subtitle2: 'Образование',
			subtitle3: 'Профессиональный Опыт',
		},
		services: {
			title: 'Услуги',
			subtitle: 'Мои услуги',
		},
		portfolio: {
			title: 'Портфолио',
			subtitle: 'Мои работы',
		},
		contact: {
			title: 'Контакт',
			subtitle: 'Свяжитесь со мной',
			myaddress: 'Астана, Казахстан',
			subtitle1: 'Социальные профили',
			emailme: 'Напиши мне',
			callme: 'Позвоните мне',
		},
	},
	labels: {
		birthday: 'День рождения',
		website: 'Веб-сайт',
		phone: 'Телефон',
		city: 'Город',
		age: 'Возраст',
		degree: 'Степень',
		email: 'Email',
		freelance: 'Фриланс',
		clients: 'Счастливые клиенты',
		projects: 'Проекты',
		supportTime: 'Часы поддержки',
		awards: 'Награды',
		myaddress: 'Мой адрес',
		loading: 'Загрузка',
	},
	reviews: {
		0: {
			author: 'Вы',
			text: 'Ваш отзыв может быть здесь',
			role: 'Удивительный клиент',
		},
		1: {
			author: 'Вы',
			text: 'Ваш отзыв может быть здесь',
			role: 'Удивительный клиент',
		},
		2: {
			author: 'Вы',
			text: 'Ваш отзыв может быть здесь',
			role: 'Удивительный клиент',
		},
		3: {
			author: 'Вы',
			text: 'Ваш отзыв может быть здесь',
			role: 'Удивительный клиент',
		},
		4: {
			author: 'Вы',
			text: 'Ваш отзыв может быть здесь',
			role: 'Удивительный клиент',
		},
	},
	placeholder: {
		name: 'Ваше имя',
		email: 'Ваш адрес электронной почты',
		subject: 'Предмет',
		message: 'Сообщение',
	},
	commands: {
		send: 'Отправить сообщение',
	},
	messeges: {
		sendedMessage: 'Ваше сообщение было отправлено. Спасибо!',
	},
	filters: {
		all: 'Все',
		app: 'Приложение',
		web: 'Веб',
		card: 'Карта',
		apk: 'APK',
		pwa: 'PWA',
	},
	services: {
		0: {
			title: 'Фронтенд-разработка',
			text: 'Кроссбраузерная и адаптивная веб-разработка с использованием HTML5, CSS3 и современных фреймворков CSS (Bootstrap, Tailwind CSS). Оптимизация загрузки и производительности страницы. Использование препроцессоров (Sass, LESS) для упрощения и ускорения разработки.',
		},
		1: {
			title: 'Создание сайта',
			text: 'Полный цикл разработки и запуска сайтов на современных платформах и CMS (WordPress, Joomla, Drupal). Интеграция с различными API и внешними сервисами (платёжные системы, соцсети, CRM). Создание динамических и интерактивных элементов с использованием JavaScript и популярных фреймворков (React, Angular, Vue.js).',
		},
		2: {
			title: 'PWA (прогрессивное веб-приложение)',
			text: 'Разработка прогрессивных веб-приложений, обеспечивающих удобство работы на мобильных устройствах. Реализация офлайн-доступа, push-уведомлений и кэширования для быстрой загрузки контента. Оптимизация приложений для максимальной производительности и удобства пользователя.',
		},
		3: {
			title: 'Поддержка веб-сайта',
			text: 'Регулярные обновления контента и техническая поддержка. Мониторинг и исправление ошибок, обеспечение безопасности. SEO-оптимизация для улучшения видимости в поисковых системах. Анализ и улучшение пользовательского опыта (UX/UI).',
		},
	},
	resume: `{'${JSON.stringify([
		{
			class: 'col-lg-6',
			blocks: [
				{
					title: 'Краткое содержание',
					subblocks: [
						{
							class: 'pb-0',
							title: 'Нургельди Серикбай',
							year: '',
							italtext:
								'Инновационный и ориентированный на сроки графический дизайнер с более чем 3-летним опытом проектирования и разработки ориентированных на пользователя цифровых/печатных маркетинговых материалов от первоначальной концепции до окончательного, отточенного результата.',
							text: '',
							list: [
								'Астана, Казахстан',
								'+7 708 341 60 54',
								'nurikserikbay1995@gmail.com',
							],
						},
					],
				},
				{
					title: 'Образование',
					subblocks: [
						{
							class: '',
							title: 'Бакалавр химии',
							year: '2013 - 2017',
							italtext:
								'Евразийский национальный университет имени Л. Н. Гумилева, Астана, Казахстан',
							text: '',
							list: [],
						},
					],
				},
				{
					title: 'Профессиональный опыт',
					subblocks: [
						{
							class: '',
							title: 'Веб-разработчик',
							year: '2023 - По настоящее время',
							italtext: 'ТОО «Крокос», Астана, Казахстан',
							text: '',
							list: [
								'Работа с фреймворками пользовательского интерфейса, такими как Quasar и Vuetify.',
								'Стилизация с помощью Tailwind CSS.',
								'Разработка и поддержка монолитных систем с использованием PHP и Vue.js.',
								'Разработка пользовательских интерфейсов с использованием Vue.js',
								'Опыт работы с компонентами Vue, включая создание и повторное использование компонентов',
								'Государственное управление с помощью Vuex, Pinia',
								'Настройка маршрутизации с помощью Vue Router',
								'Работа с сервером и клиентом через Vue Resource или Axios для HTTP-запросов',
								'Исправление и обслуживание ошибок в проектах React и Next.js.',
								'Исправление ошибок и рефакторинг устаревших проектов.',
								'Проверка формы и обработка событий в Vue.js',
								'Оптимизация производительности приложений Vue',
								'Создание RESTful API и интеграция с серверной частью',
							],
						},
					],
				},
			],
		},
		{
			class: 'col-lg-6',
			blocks: [
				{
					title: '',
					subblocks: [
						{
							class: '',
							title: 'Vue, Nuxt разработчик',
							year: '2022 - 2023',
							italtext: 'ТОО «Ракетная фирма», Астана, Казахстан',
							text: '',
							list: [
								'Верстка и разработка компонентов, исправление ошибок',
								'Проверка кода',
								'Рефакторинг',
								'Разработка пользовательских интерфейсов с использованием Vue.js',
								'Опыт работы с компонентами Vue, включая создание и повторное использование компонентов',
								'Управление состоянием с помощью Vuex',
								'Настройка маршрутизации с помощью Vue Router',
								'Работа с сервером и клиентом через Vue Resource или Axios для HTTP-запросов',
								'Обработка данных в реальном времени и интеграция WebSocket',
								'Анимации и переходы с использованием Vue Transitions',
								'Проверка формы и обработка событий в Vue.js',
								'Настройка и использование инструментов сборки (Webpack, Vue CLI)',
								'Работа с препроцессорами CSS (Sass, Less)',
								'Оптимизация производительности приложений Vue',
								'Контроль версий с помощью Git',
								'Создание RESTful API и интеграция с серверной частью',
								'Реализация принципов атомарного дизайна для компонентов пользовательского интерфейса',
								'Разработка модульной архитектуры для масштабируемых и поддерживаемых кодовых баз',
							],
						},
						{
							class: '',
							title: 'Vue разработчик',
							year: '2020 - 2022',
							italtext: 'ТОО «C&A Consulting Group», Астана, Казахстан',
							text: 'Разработка SPA-приложений, симуляций, цифровых образовательных ресурсов',
							list: [
								'Внедрение в проект новых библиотек',
								'Разработка дизайн-системы',
								'Участие в разработке нового пользовательского интерфейса',
								'Участие в разработке новых функций',
								'Макет',
								'Анимация',
								'Исправление ошибок',
								'Создавал 4+ дизайнерских презентаций и предложений в месяц для клиентов и менеджеров по работе с клиентами',
							],
						},
					],
				},
			],
		},
	])}'}`,
}
